#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
cloudflare_dns_record.subdomain["duplicati"]: Refreshing state... [id=5a5346128a89036f56dffb01d6f93331]
cloudflare_dns_record.subdomain["wyl"]: Refreshing state... [id=4eafff3b6a48e4ec6f48c55725beffe8]
cloudflare_dns_record.subdomain["slskd"]: Refreshing state... [id=87af31870c7e31b8ee2d5552b1c10366]
cloudflare_dns_record.subdomain["mass"]: Refreshing state... [id=fde6f1daa207cfc26fb490828abdc544]
cloudflare_dns_record.subdomain["radar"]: Refreshing state... [id=38319dbe4e1cfad284231476edc38889]
cloudflare_dns_record.subdomain["compartilhado"]: Refreshing state... [id=d98ef582341c5a9af8dc22bc5271065a]
cloudflare_dns_record.subdomain["autobrr"]: Refreshing state... [id=9908c6b5aa8e2644bab177dba4507805]
cloudflare_r2_bucket.rpi_k8s_crunchy_postgres: Refreshing state... [id=rpi-k8s-crunchy-postgres]
cloudflare_dns_record.subdomain["qbittorrent"]: Refreshing state... [id=1235068106d632353bff5ebe0b25e4f9]
cloudflare_r2_bucket.rpi_k8s: Refreshing state... [id=rpi-k8s-backup]
cloudflare_dns_record.subdomain["npm"]: Refreshing state... [id=a99c520d8996b2b27fcbb18e4b27e01e]
cloudflare_dns_record.subdomain["minio"]: Refreshing state... [id=b3177206a49bab5cbf0e85fae07f729b]
cloudflare_dns_record.subdomain["adguard"]: Refreshing state... [id=c7cf428927d7229926a6557b43efe499]
cloudflare_dns_record.subdomain["lidarr"]: Refreshing state... [id=684512b6d71d4ce7f45698b5bb614983]
cloudflare_dns_record.subdomain["anime"]: Refreshing state... [id=81715400924f0352fabaa6cda98f8390]
cloudflare_dns_record.subdomain["sabnzbd"]: Refreshing state... [id=0c25031723695d9467caf3fe0b1516d1]
cloudflare_dns_record.subdomain["portainer"]: Refreshing state... [id=a192bc77002ac9b1e2da2405d0b35c95]
cloudflare_dns_record.subdomain["nextcloud"]: Refreshing state... [id=2cbbd46a6b02f11383e029cf4ed2eada]
cloudflare_dns_record.subdomain["n8n"]: Refreshing state... [id=631df7f513fc03158463d2c5cdf77712]
cloudflare_dns_record.subdomain["bazar"]: Refreshing state... [id=1fa8a93e9e0d5025720ca8dd8de29494]
cloudflare_dns_record.subdomain["openweb-ui"]: Refreshing state... [id=210d086ac9f9bd89916fe92fbb9744e7]
cloudflare_dns_record.subdomain["readar"]: Refreshing state... [id=05631c75d8ba7f616f6dbea94ba36cf6]
cloudflare_dns_record.subdomain["minio-data"]: Refreshing state... [id=e9d8787961b911d2d209f7f79454b9db]
cloudflare_dns_record.subdomain["vscode"]: Refreshing state... [id=fc96349ff0a78007beb84e7ae026fa02]
cloudflare_dns_record.subdomain["tandoor"]: Refreshing state... [id=b6e4679dd76ca4bebac7f9ee2949e3f8]
cloudflare_dns_record.subdomain["homebridge"]: Refreshing state... [id=c27afc06733372f8e5689dd18b3cf536]
cloudflare_dns_record.subdomain["hass"]: Refreshing state... [id=b746c78abb7f7620636f40382601edc0]
cloudflare_dns_record.subdomain["jellyfin"]: Refreshing state... [id=8e526b3f1594ee9c9f82d1cfd6b57f59]
cloudflare_dns_record.subdomain["kvm"]: Refreshing state... [id=723f05d19f4c5df2682bd880117b5557]
cloudflare_dns_record.subdomain["kuma"]: Refreshing state... [id=2cf22dc44cca37bf09d273efa550e0e5]
cloudflare_dns_record.subdomain["jellyseerr"]: Refreshing state... [id=f6e73557e862db18dbbb0dfff694829a]
cloudflare_dns_record.subdomain["sonar"]: Refreshing state... [id=ca12cc26c124181feadf59183a55e039]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_dns_record.subdomain["glances"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + content          = (sensitive value)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "glances.atoca.house"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["syncthing"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + content          = (sensitive value)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "syncthing.atoca.house"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*